### **Ejercicio 1: Limpiar y transformar columnas de texto**
Dado el siguiente DataFrame de productos:

In [13]:
import pandas as pd

data = {
    'Producto': ['Café', 'té', ' chocolate', ' Cacao '],
    'Precio': [100, 80, 150, 120],
    'Categoría': ['bebidas calientes', 'bebidas calientes', 'snacks dulces', ' bebidas calientes ']
}

df_productos = pd.DataFrame(data)

1. Elimina los espacios en blanco de las columnas **Producto**.
2. Convierte todos los valores de la columna **Categoría** a mayúsculas.
3. Reemplaza la categoría 'snacks dulces' por 'postres'.
4. Crea una nueva columna que indique si el precio es mayor o igual a 120. Usa una función `lambda` para esto.

In [20]:
## Parte 1
##df_productos['Producto'] = df_productos['Producto'].str.replace(" ","")
## Parte 1
df_productos['Producto'] = df_productos['Producto'].str.strip()
df_productos

## Parte 2
df_productos['Categoría'] = df_productos['Categoría'].str.upper()
df_productos

## Parte 3
df_productos['Categoría'] = df_productos['Categoría'].str.replace("SNACKS DULCES","POSTRES")
df_productos

## Parte 4
df_productos['PrecioMayor120'] = df_productos['Precio'].apply(lambda x: x > 120,'Si')
df_productos

C:\Users\cgrod\AppData\Local\Temp\ipykernel_13060\1011092036.py:16: FutureWarning: the convert_dtype parameter is deprecated and will be removed in a future version.  Do ``ser.astype(object).apply()`` instead if you want ``convert_dtype=False``.
  df_productos['PrecioMayor120'] = df_productos['Precio'].apply(lambda x: x > 120,'Si')

    Producto  Precio            Categoría  PrecioMayor120
0       Café     100    BEBIDAS CALIENTES           False
1         té      80    BEBIDAS CALIENTES           False
2  chocolate     150              POSTRES            True
3      Cacao     120   BEBIDAS CALIENTES            False

### **Ejercicio 2: Limpieza de duplicados y manejo de datos faltantes**
Dado el siguiente DataFrame de empleados:

In [82]:
data_empleados = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Luis', 'Juan', 'Ana'],
    'Edad': [29, 45, None, 40, 35, 29],
    'Departamento': ['Ventas', 'Finanzas', 'RRHH', 'Finanzas', 'Marketing', None]
}

df_empleados = pd.DataFrame(data_empleados)
df_empleados

  Nombre  Edad Departamento
1   Luis  45.0     Finanzas
3   Luis  40.0     Finanzas
4   Juan  35.0    Marketing
0    Ana  29.0       Ventas
5    Ana  29.0         None
2  Pedro   NaN         RRHH

1. Elimina las filas duplicadas en base a la columna **Nombre**. Quédate con la persona `más joven´.
2. Llena los valores faltantes de la columna **Edad** con la media de las edades.
3. Llena los valores faltantes de la columna **Departamento** con el valor 'Desconocido'.
4. Ordena el DataFrame por edad de forma descendente.

In [83]:
# Parte 1
df_empleados.sort_values(['Edad'],ascending=False,inplace=True)
df_empleados.drop_duplicates(inplace=True,subset=['Nombre'],keep='last')
df_empleados

# Parte 2
# Rellenar valores faltantes con la media
edad_media = df_empleados['Edad'].mean()
df_empleados['Edad'] = df_empleados['Edad'].fillna(edad_media)
df_empleados

# Parte 3
df_empleados['Departamento'] = df_empleados['Departamento'].fillna('Desconocido')
df_empleados

# Parte 4
# Se hizo en la parte 1 para eliminar duplicados

  Nombre       Edad Departamento
3   Luis  40.000000     Finanzas
4   Juan  35.000000    Marketing
5    Ana  29.000000  Desconocido
2  Pedro  34.666667         RRHH

### **Ejercicio 3: Aplicar funciones a las columnas**
Dado un DataFrame de ventas de productos:

In [84]:
data_ventas = {
    'Producto': ['Café', 'Té', 'Jugo', 'Agua'],
    'Precio': [120, 80, 90, 60],
    'Cantidad': [3, 5, 2, 8]
}

df_ventas = pd.DataFrame(data_ventas)

1. Calcula el total de ventas (Precio * Cantidad) y agrégalo como una nueva columna.
2. Crea una nueva columna llamada **Descuento** que aplique un descuento del 10% si el precio es mayor a 100, y del 5% si es menor o igual a 100. Usa la función `apply` y una función `lambda`.

In [106]:
# Parte 1
df_ventas['TotalVentas'] = df_ventas['Precio'] * df_ventas['Cantidad']
df_ventas

# Parte 2
df_ventas['Descuento'] = df_ventas['Precio'].apply(lambda x: x-(x*0.1) if x > 100 else  x-(x*0.05))

df_ventas

##df_productos['PrecioMayor120'] = df_productos['Precio'].apply(lambda x: x > 120,'Si')

  Producto  Precio  Cantidad  TotalVentas  Descuento
0     Café     120         3          360      108.0
1       Té      80         5          400       76.0
2     Jugo      90         2          180       85.5
3     Agua      60         8          480       57.0

### **Ejercicio 4: Uso de funciones de cadena**
Dado el siguiente DataFrame de direcciones de clientes:

In [137]:
data_clientes = {
    'Cliente': ['Juan Pérez', 'Ana Ruiz', 'Pedro López'],
    'Dirección': ['calle falsa 123', 'Calle PRINCIPAL 45', 'AV. LOS robles 34']
}

df_clientes = pd.DataFrame(data_clientes)
df_clientes

       Cliente           Dirección
0   Juan Pérez     calle falsa 123
1     Ana Ruiz  Calle PRINCIPAL 45
2  Pedro López   AV. LOS robles 34

1. Convierte todos los valores de la columna **Dirección** a minúsculas.
2. Reemplaza las abreviaturas "calle", "av." por "calle" y "avenida" respectivamente.
3. Extrae el número de la dirección y guárdalo en una nueva columna llamada **Número**.

In [139]:
# Parte 1
df_clientes['Dirección'] = df_clientes['Dirección'].str.lower()
df_clientes

#Parte 2
df_clientes['Dirección'] = df_clientes['Dirección'].str.replace("av","avenida")

#Parte 3
df_clientes['Numero'] = df_clientes['Dirección'].str.extract('(\d+)')
df_clientes

<>:9: SyntaxWarning: invalid escape sequence '\d'
<>:9: SyntaxWarning: invalid escape sequence '\d'
C:\Users\cgrod\AppData\Local\Temp\ipykernel_13060\3364547382.py:9: SyntaxWarning: invalid escape sequence '\d'
  df_clientes['Numero'] = df_clientes['Dirección'].str.extract('(\d)')

       Cliente                    Dirección Numero
0   Juan Pérez              calle falsa 123      1
1     Ana Ruiz           calle principal 45      4
2  Pedro López  avenidaenida. los robles 34      3